The current edits are causing some webs to disjoin. The truss layout family requires additional constraints to maintain these joins.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId TrussNotJoinedWebs { get; }
  Visual Basic
Public Shared ReadOnly Property TrussNotJoinedWebs As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ TrussNotJoinedWebs {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures TrussFailures Class
  Autodesk.Revit.DB Namespace